Revit 2024 API
IFCAggregateIterator.Reset Method
 Resets the iterator to the beginning of the aggregate.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public virtual void Reset()
Visual Basic
Public Overridable Sub Reset
Visual C++
public:
virtual void Reset()
See Also
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace